cornreform/a7s-chan/firmware/sdkconfig.defaults
# ESP32-S3 M5Stack CoreS3 configuration - NO PSRAM (v0.2 silicon bug workaround)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_FIRMWARE_CHIP_ID=0x9

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_64B=y

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_TASK_CORE_ID=1
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=512

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="stack-chan"
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# Logging
CONFIG_LOG_MAXIMUM_LEVEL=4
CONFIG_LOG_COLORS=y

# RMT
CONFIG_RMT_ENABLE_DEBUG_LOG=n

# I2S
CONFIG_I2S_ENABLE_DEBUG_LOG=n

# LWIP UDP
CONFIG_LWIP_UDP=y

# MDNS
CONFIG_MDNS_ENABLE_SERVICE_PRINT=n

# PSRAM - DISABLED for v0.2 chip compatibility
# CONFIG_ESP32S3_SPIRAM_SUPPORT is not set
